{"data":{"site":{"siteMetadata":{"title":"Coding Illusions","author":"Alex Landini"}},"markdownRemark":{"id":"6cf7c07e-2081-577a-818d-2c71cc19070b","excerpt":"Every developer has a kind of six sense, that we can call  sense of code , this is a very personal feeling about what is a good code.  Clean code  could be…","html":"<blockquote class=\"twitter-tweet\" lang=\"en\">\n    <p lang=\"en\" dir=\"ltr\">Beautiful code, like beautiful prose, is the result of many small decisions. The right method length here, the right object name there.</p>&mdash; DHH (@dhh) <a href=\"https://twitter.com/dhh/status/447042824622850048\">March 21, 2014</a>\n</blockquote>\n<p>Every developer has a kind of six sense, that we can call <em>sense of code</em>, this is a very personal feeling about what is a good code. <em>Clean code</em> could be considered the formalization effort of best programmers’ sense of code, which they’ve developed through their experience.</p>\n<p>Before listing the practices to achieve clean code, let’s try to understand what has led to those practices.</p>\n<p>Why we should really care about <em>clean code</em>, according to Robert Martin <a href=\"http://www.amazon.com/Clean-Code-Handbook-Software-Craftsmanship/dp/0132350882\">Clean code</a>{:target=“_blank”} book:</p>\n<blockquote>\n<p>Its estimated that on an average a developer spends around 80% percent of the time reading code that has already been written. Efficiency of team can greatly decrease if the time spent by developers in reading and understanding the code increases from 80% to 90-95%</p>\n</blockquote>\n<p>So developers need to write <em>easily understandable code</em> for other developers.<br>\nClean code is about recognizing that your audience isn’t just a computer, but are your fellow developers.</p>\n<blockquote>\n<p>Programming is the art of telling another human what one wants the computer to do.</p>\n<p>Donald Knuth</p>\n</blockquote>\n<p>Donald Knuth formalized the concept of <a href=\"http://www.literateprogramming.com/\"><em>literate programming</em></a>{:target=“_blank”}:</p>\n<blockquote>\n<p>The practitioner of literate programming can be regarded as an essayist, whose main concern is with exposition and excellence of style. Such an author, with thesaurus in hand, chooses the names of variables carefully and explains what each variable means. He or she strives for a program that is comprehensible because its concepts have been introduced in an order that is best for human understanding, using a mixture of formal and informal methods that reinforce each other.</p>\n</blockquote>\n<p>Maybe this is to much, but it highlights an analogy between programming and writing.\nThe code should tell a clear compelling story, whose topics are the requirements.\nDevelopers write it by using classes, methods (or functions), variables, expressions and comments.\nTo become good writer, we as developers need to practice with good programming practice, to learn how to organize painlessly our code.</p>\n<p>What are the principles that clean code has:</p>\n<ul>\n<li>Meaningful and descriptive naming</li>\n<li>Proper expressive abstractions</li>\n<li>It’s readable and expressive</li>\n</ul>\n<p>Robert Martin in the book <a href=\"http://www.amazon.com/Clean-Code-Handbook-Software-Craftsmanship/dp/0132350882\">Clean code</a>{:target=“_blank”} gives some rules about how to write good code.\nSo What are clean code principles:</p>\n<ul>\n<li>Meaningful names</li>\n<li>Functions</li>\n<li>Comments</li>\n<li>Object and data structure</li>\n<li>Error handling</li>\n<li>Unit testing</li>\n<li>Classes</li>\n</ul>\n<h3>References</h3>\n<ul>\n<li><a href=\"http://www.literateprogramming.com/\">literate programming</a></li>\n<li><a href=\"http://blog.pluralsight.com/7-reasons-clean-code-matters\">pluralsight</a></li>\n<li><a href=\"http://www.amazon.com/Clean-Code-Handbook-Software-Craftsmanship/dp/0132350882\">Clean code</a></li>\n</ul>","frontmatter":{"title":"Clean code: a review","date":"June 02, 2015","description":"Clean code a review"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/clean-code/","previous":{"fields":{"slug":"/hi-folks/"},"frontmatter":{"title":"New Beginnings"}},"next":{"fields":{"slug":"/anti-if-patterns-enums/"},"frontmatter":{"title":"Anti-if patterns: Enums"}}}}